publications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 04.18.25 12:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>publications | alex bellon</title>
<meta name="author" content="Alex" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='assets/css/common.css'>
<link rel='stylesheet' type='text/css' href='assets/css/main.css'>
<link rel='icon' type='image/png' href='./images/art/personal_logo.png'>
<meta name='viewport' content='width=device-width, initial-scale=.5'>
<meta charset='utf-8'/>
<base target='_blank'/>
</head>
<body>
<div id="preamble" class="status">
<ul class='header banner'>
    <li><a target='_parent' href='.'>home</a></li>
    <li><a target='_parent' href='./publications'>publications</a></li>
    <li><a target='_parent' href='./projects'>projects</a></li>
    <li><a target='_parent' href='./experience'>experience</a></li>
    <li><a target='_parent' href='./blog'>blog</a></li>
    <li><a target='_parent' href='./misc'>misc</a></li>
</ul>
</div>
<div id="content" class="content">
<div id="publications" class="main">
<div class="contentBlock">

<p>
(*) indicates first author(s)
</p>
<div id="outline-container-org6d37a17" class="outline-2">
<h2 id="org6d37a17"><a href="pubs/2025-cslaw-nsl.pdf">an empirical analysis on the use and reporting of national security letters</a></h2>
<div class="outline-text-2" id="text-org6d37a17">
<p>
alex bellon, miro haller*, andrey labunets, enze liu, stefan savage. <i>CS&amp;Law 2025</i>
</p>
<p class="publinks">
[<a href="pubs/2025-cslaw-nsl.pdf" class="publinks">pdf</a>] [<a href="https://dl.acm.org/doi/10.1145/3709025.3712209">doi</a>] [<a href="https://github.com/ucsdsysnet/nsl-empirical-analysis">data + code</a>] [<a href="https://computersciencelaw.org/2025">conference</a>]
</p>
</div>
</div>
<div id="outline-container-orgca72c7f" class="outline-2">
<h2 id="orgca72c7f"><a href="pubs/2023-soups-via.pdf">understanding the viability of e-mail origin indicators for identifying the sender</a></h2>
<div class="outline-text-2" id="text-orgca72c7f">
<p>
enze liu*, lu sun, alex bellon, grant ho, stefan savage, geoffrey m. voelker, imani n. s. munyaka. <i>SOUPS 2023</i>
</p>
<p class="publinks">
[<a href="pubs/2023-soups-via.pdf" class="publinks">pdf</a>] [<a href="https://www.usenix.org/conference/soups2023/presentation/liu">usenix page</a>] [<a href="https://www.usenix.org/conference/soups2023">conference</a>]
</p>
</div>
</div>
<div id="outline-container-org5ca9d15" class="outline-2">
<h2 id="org5ca9d15"><a href="pubs/2023-hotmobile-tagalong.pdf">tagalong: a free, wide-area data-muling service built on the airtag protocol</a></h2>
<div class="outline-text-2" id="text-org5ca9d15">
<p>
alex bellon*, alex yen, pat pannuto. <i>HotMobile 2023</i>
</p>
<p class="publinks">
[<a href="pubs/2023-hotmobile-tagalong.pdf" class="publinks">pdf</a>] [<a href="pubs/2023-hotmobile-tagalong-slides.pdf">slides</a>] [<a href="https://dl.acm.org/doi/10.1145/3572864.3580342">doi</a>] [<a href="https://hotmobile.org/2023/">conference</a>]
</p>
</div>
</div>
<div id="outline-container-orgbc8c154" class="outline-2">
<h2 id="orgbc8c154"><a href="pubs/2022-techcon-hacking-for-fun-and-glucose.pdf">hacking for fun and glucose: reverse engineering an insulin pump</a></h2>
<div class="outline-text-2" id="text-orgbc8c154">
<p>
alex bellon*, alex snoeren, deian stefan. <i>SRC TECHCON 2022</i>
</p>
<p class="publinks">
[<a href="pubs/2022-techcon-hacking-for-fun-and-glucose.pdf" class="publinks">pdf</a>] [<a href="pubs/2022-techcon-slides.pdf">slides</a>] [<a href="https://src.secure-platform.com/a/page/techcon">conference</a>]
</p>


<p class="divider">
demos and posters
</p>
</div>
</div>
<div id="outline-container-orgcd26aaa" class="outline-2">
<h2 id="orgcd26aaa"><a href="pubs/2022-sensys-tagalong-demo.pdf">demo: tagalong: a free, wide-area data-muling service built on the airtag protocol</a></h2>
<div class="outline-text-2" id="text-orgcd26aaa">
<p>
alex bellon*, alex yen, pat pannuto. <i>SenSys 2022</i>
</p>
<p class="publinks">
[<a href="pubs/2022-sensys-tagalong-demo.pdf" class="publinks">pdf</a>] [<a href="pubs/2022-sensys-tagalong-poster.pdf">poster</a>] [<a href="https://www.youtube.com/watch?v=c1jwv0srtu4">video</a>] [<a href="https://dl.acm.org/doi/abs/10.1145/3560905.3568085">doi</a>] [<a href="https://sensys.acm.org/2022/">conference</a>]
</p>


<p class="divider">
fun papers
</p>
</div>
</div>
<div id="outline-container-orgba58b8d" class="outline-2">
<h2 id="orgba58b8d"><a href="pubs/2024-sigbovik-et-alex.pdf">et al(ex): examining the impact of alexs on the field of computer science</a></h2>
<div class="outline-text-2" id="text-orgba58b8d">
<p>
alex bellon, alex liu, alex(ander) redding, alex c snoeren, alex yen. <i>SIGBOVIK 2024</i>
</p>
<p class="publinks">
[<a href="pubs/2024-sigbovik-et-alex.pdf" class="publinks">pdf</a>] [<a href="https://sigbovik.org/2024/">conference</a>]
</p>


<p class="divider">
writeups and articles
</p>
</div>
</div>
<div id="outline-container-org86c338d" class="outline-2">
<h2 id="org86c338d"><a href="pubs/mozilla-internship-writeup.pdf">the impact of maintainers on package ecosystem security</a></h2>
<div class="outline-text-2" id="text-org86c338d">
<p>
<b>alex bellon</b>. <i>mozilla internship project blog post</i>
</p>
</div>
</div>
<div id="outline-container-org1352ce3" class="outline-2">
<h2 id="org1352ce3"><a href="pubs/cptc-report-2020.pdf">cptc report 2020</a></h2>
<div class="outline-text-2" id="text-org1352ce3">
<p>
<b>alex bellon</b>, nathan huckleberry, alice reuter, soham roy. <i>pentesting report for CPTC southeast regional 2020</i>
</p>
</div>
</div>
<div id="outline-container-org8c51b5d" class="outline-2">
<h2 id="org8c51b5d"><a href="pubs/cptc-report-2019.pdf">cptc report 2019</a></h2>
<div class="outline-text-2" id="text-org8c51b5d">
<p>
neil patil, <b>alex bellon</b>, nathan huckleberry, alice reuter, logan kirkpatrick, joseph manahan. <i>pentesting report for CPTC new england regional 2019</i>
</p>
</div>
</div>
<div id="outline-container-orgba230fa" class="outline-2">
<h2 id="orgba230fa"><a href="https://pagedout.institute/download/PagedOut_001_beta1.pdf">rubikstega</a></h2>
<div class="outline-text-2" id="text-orgba230fa">
<p>
<b>alex bellon</b>. <i>article in <a href="https://pagedout.institute/">Paged Out!</a> zine</i>
</p>
</div>
</div>
<div id="outline-container-org6f97a67" class="outline-2">
<h2 id="org6f97a67"><a href="https://github.com/alex-bellon/ctf-writeups">ctf challenge writeups</a></h2>
<div class="outline-text-2" id="text-org6f97a67">
<p>
<b>alex bellon</b>. <i>writeups for challenges I have completed while compething in ctfs. too many to post here individually :)</i>
</p>

</div></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div>
    <ul class='footer banner' style='margin-top:0px; margin-bottom:0px;'>
        <span class='footer-container'>
            <span>
                <li><a target='_parent' href='./cv.pdf'>cv</a></li>
                <li><a target='_parent' href='https://github.com/alex-bellon/'>github</a></li>
                <li><a target='_parent' href='https://scholar.google.com/citations?user=caybufUAAAAJ'>scholar</a></li>
            </span>
            <span>
                <li><a href='https://alex-bellon.com'>home</a></li>
                <li><a target='_parent' href='https://github.com/alex-bellon/alex-bellon.com'>website source</a></li>
            </span>
        </span>
    </ul>
</div
</div>
</body>
</html>
